Revit 2027 API
RebarCrankOverridableParameters.GetCrankEndOffsetLengthFormulaParams Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCrankEndOffsetLengthFormulaParams()
Public Function GetCrankEndOffsetLengthFormulaParams As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCrankEndOffsetLengthFormulaParams()
member GetCrankEndOffsetLengthFormulaParams : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Retruns the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace